# -*- coding: utf-8 -*-
import numpy as np
class Locations:

    def __init__(self):
        pass
    def loadTowns(self):

        towns = dict()
        self.towns = towns
        
        towns[u"ਚੰਡੀਗੜ੍ਹ"] = np.array([
                                    u"ਚੰਡੀਗੜ੍ਹ",
                                    u"ਬਹਿਲਾਨਾ",
                                    u"ਦਾਰਿਆ",
                                    u"ਖੁਦਾ ਅੱਲਿਸ਼ਰ",
                                    u"ਮਨੀ ਮਾਜਰਾ",
                                    u"ਬਸਤੀ ਕਿਸ਼ਗਰਹ",
                                    u"ਬਸਤੀ ਭਗਵਾਨਪੁਰਾ",
                                    u"ਮੌਲੀ ਜਾਗਰਣ"
                                ])
        
        towns[u'ਲੁਧਿਆਣਾ'] = np.array( [
	u"ਲੁਧਿਆਣਾ",
	u"ਖੰਨਾ",
	u"ਜਾਗਰਾਨ",
	u"ਰਾਏਕੋਟ",
	u"ਦੋਰਾਹਾ",
	u"ਮਾਛੀਵਾੜਾ",
	u"ਸਾਹਨੇਵਾਲ",
	u"ਸਮਾਰਾਲਾ",
	u"ਮੁਲਤਾਨਪੁਰ ਦਾਖਾ"
	u"ਪਾਇਲ",
	u"ਮਲੌਦ"
	])
        
        towns[u'ਅਮ੍ਰਿਤਸਰ'] = np.array( [
	u"ਅਮ੍ਰਿਤਸਰ",
	u"ਜੰਡਿਆਲਾ",
	u"ਅੰਜਲਾ",
	u"ਰਈਆ",
	u"ਮਜੀਠਾ",
	u"ਰਾਜਾ ਸਾਂਸੀ",
	u"ਰਾਮਦਾਸ"
	])
        
        towns[u'ਜਲੰਧਰ'] = np.array([
	u"ਜਲੰਧਰ",
	u"ਨਕੋਦਰ",
	u"ਕਰਤਾਰਪੁਰ",
	u"ਫਿਲੌਰ",
	u"ਆਦਮਪੁਰ",
	u"ਭੋਗਪੁਰ",
	u"ਗੋਰਾਇਆ",
	u"ਨਰਮਹਿਲ",
	u"ਸ਼ਾਹਕੋਟ",
	u"ਲੋਹੀਅਨ ਖ਼ਸ",
	u"ਅਲਵਾਲਪੁਰ",
	u"ਮਹਿਤਾਪੁਰ"
	])

        towns[u'ਪਟਿਆਲਾ'] = np.array([
	u"ਪਟਿਆਲਾ",
	u"ਰਾਜਪੁਰਾ",
	u"ਨਾਭਾ",
	u"ਸਮਾਣਾ",
	u"ਪਤ੍ਰਣ",
	u"ਸਨੌਰ",
	u"ਘੱਗਾ",
	u"ਭਡਸਨ",
	u"ਘਨੌਰ"
	])

        towns[u'ਬਠਿੰਡਾ'] = np.array([
	u"ਬਠਿੰਡਾ",
	u"ਰਾਮਪੁਰਾ ਫੂਲ",
	u"ਮੌੜ",
	u"ਰਮਨ",
	u"ਤਲਵੰਡੀ ਸਾਬੋ",
	u"ਮਹਿਰਾਜ",
	u"ਗੋਨਿਆਣਾ",
	u"ਭੂਚੋ ਮੰਡੀ",
	u"ਭਾਈ ਰੂਪ",
	u"ਭਗਤਾ ਭਾਈ ਕਾ",
	u"ਕੋਟ ਸ਼ਮੀਰ",
	u"ਲਹਿਰਾ ਮੁਹੱਬਤ",
	u"ਕੋਠਾ ਗੁਰੂ",
	u"ਚਾਕੂ"
	u"ਮੰਡੀ ਕਲਾਨ",
	u"ਰਾਮਪੁਰਾ",
	u"ਬਾਲੀਅਨ ਵਾਲੀ",
	u"ਨਾਥਾਨਾ",
	u"ਕੋਟ ਫੱਤਾ",
	u"ਮਲੂਕਾ",
	u"ਸੰਗਤ"
	])

        towns[u'ਹੁਸ਼ਿਆਰਪੁਰ'] = np.array( [
	u"ਹੁਸ਼ਿਆਰਪੁਰ",
	u"ਮੁਕੇਰੀਆਂ",
	u"ਦਸ਼ੂਆ",
	u"ਊਮਰਰ ਟਾਂਡਾ",
	u"ਤਲਵਾੜਾ",
	u"ਗੜ੍ਹਸ਼ੰਕਰ",
	u"ਮਾਹਿਲਪੁਰ",
	u"ਹਰੀਆਰਾ",
	u"ਗੜ੍ਹੀਵਾਲਾ",
	u"ਸ਼ਮ ਚੌਰਾਸੀ"
	])

        towns[u'ਐਸ.ਏ.ਏ. ਨਗਰ'] = np.array([
	u"ਐਸ ਏ ਨਗਰ",
	u"ਜ਼ੀਰਕਪੁਰ",
	u"ਖਰੜ",
	u"ਨਯਾ ਗਾਓਂ",
	u"ਕੁਰਾਲੀ",
	u"ਡੇਰਾ ਬੱਸੀ",
	u"ਲਾਲੜੂ",
	u"ਬਨੁਰ"
	])

        towns[u"ਮੋਗਾ"] = np.array([
	u"ਮੋਗਾ",
	u"ਬਾਘ ਪੁਰਾਣਾ",
	u"ਧਰਮਕੋਟ",
	u"ਕੋਟ ਈਸੇ ਖ਼ਾਨ",
	u"ਨਿਹਾਲ ਸਿੰਘ ਵਾਲਾ",
	u"ਬੱਧਨੀ ਕਲਾਨ"
	])

        towns[u"ਗੁਰਦਾਸਪੁਰ"] = np.array( [
	u"ਗੁਰਦਾਸਪੁਰ",
	u"ਬਟਾਲਾ",
	u"ਦੀਨਾ ਨਗਰ",
	u"ਕਾਦੀਆਂ",
	u"ਧਾਰੀਵਾਲ",
	u"ਫਤਿਹਗੜ੍ਹ ਚੂਰਈ",
	u"ਸ੍ਰੀ ਹਰਗੋਬਿੰਦਪੁਰ",
	u"ਡੇਰਾ ਬਾਬਾ ਨਾਨਕ"
	])

        towns[u"ਪਠਾਨਕੋਟ"] = np.array( [
	u"ਪਠਾਨਕੋਟ",
	u"ਸੁਜਾਨਪੁਰ"
	])

        towns[u"ਫਾਜ਼ਿਲਕਾ"] = np.array( [
	u"ਫਾਜ਼ਿਲਕਾ",
	u"ਅਬੋਹਰ",
	u"ਜਲਾਲਾਬਾਦ",
	u"ਅਰਨੀਵਾਲਾ ਸ਼ੇਖ ਸੁਭਾਨ"
	])


        towns[u"ਸੰਗਰੂਰ"] = np.array( [
	u"ਸੰਗਰੂਰ",
	u"ਮਲੇਰਕੋਟਲਾ",
	u"ਸੁਮਨ ਊਧਮ ਸਿੰਘ ਵਾਲਾ",
	u"ਧੂਰੀ",
	u"ਅਹਿਮਦਗਰੜ",
	u"ਲੋਂਗੋਵਾਲ",
	u"ਲਹਿਰਾਗਾਗਾ",
	u"ਭਵਾਨੀਗੜ੍ਹ",
	u"ਮੂਣਕ",
	u"ਦਿੜ੍ਹਬਾ",
	u"ਖਨੌਰੀ",
	u"ਚੀਮਾ",
	u"ਅਮਰਗੜ"
	])

        towns[u"ਮੁਕਤਸਰ"] = np.array( [
	u"ਮੁਕਤਸਰ",
	u"ਮਲੋਟ",
	u"ਗਿੱਦੜਬਾਹਾ",
	u"ਬਾਰੀਵਾਲਾ"
	])

        towns[u"ਬਰਨਾਲਾ"] = np.array( [
	u"ਬਰਨਾਲਾ",
	u"ਟਾਪਾ",
	u"ਧਨਾਉਲਾ",
	u"ਭਦੌੜ",
	u"ਹੰਦੀਈਆ"
	])

        towns[u"ਫਿਰੋਜ਼ਪੁਰ"] = np.array( [
	u"ਫਿਰੋਜ਼ਪੁਰ",
	u"ਜ਼ੀਰਾ",
	u"ਤਲਵੰਡੀ ਭਾਈ",
	u"ਗੁਰੂ ਹਰ ਸਹਾਏ",
	u"ਮੱਲਾਂਵਾਲਾ",
	u"ਮਖੂ",
	u"ਮੁਦਕੀ",
	u"ਮਮਡੋਟ"
	])

        towns[u"ਕਪੂਰਥਲਾ"] = np.array([
	u"ਕਪੂਰਥਲਾ",
	u"ਫਗਵਾੜਾ",
	u"ਸੁਲਤਾਨਪੁਰ",
	u"ਭੁਲੱਥ",
	u"ਬੇਗੋਵਾਲ",
	u"ਢਿਲਵਾਲ",
	u"ਨਡਾਲਾ"
	])
        return towns
    # ******************************************************** Villages ***************************************************************
    
    def loadVillages(self):
        
        villages = dict()
        self.villages = villages
        
        villages[u'ਚੰਡੀਗੜ੍ਹ'] = np.array( [
                                        u"ਧਨਾਸ",
                                        u"ਕਾਇਬਵਾਲਾ",
                                        u"ਰਾਏਪੁਰ ਕਲਾਂ",
                                        u"ਮੱਖਣ ਮਾਜਰਾ",
                                        u"ਰਾਏਪੁਰ ਕਲਾਂ ਅਤੇ ਮੱਖਣ ਮਾਜਰਾ",
                                        u"ਰਾਏਪੁਰ ਖੁਰਦ",
                                        u"ਸਾਰੰਗਪੁਰ"
                                    ])
        
        villages[u"ਲੁਧਿਆਣਾ"] = np.array([
                                        u"ਕੁਬਬਾ",
                                            u"ਗੋਸਲਾਨਾ",
                                            u"ਮੈਦਪੁਰ",
                                            u"ਲਾਲ ਕਲਾਂ",
                                            u"ਅਮਰਗੜ ਕਲੇਰ",
                                            u"ਆਲੀਵਾਲ",
                                            u"ਸਿਧਵਾਨ ਬੇਟ",
                                            u"ਸ਼ੇਰਪੁਰ ਕਲਾਂ",
                                            u"ਗਾਲਿਬ ਕਲਾਂ",
                                            u"ਭੰਡਰੀ",
                                            u"ਅਕਾਲਗੜ",
                                            u"ਸੁਧਾਰ",
                                            u"ਹਲਵਾਰਾ",
                                            u"ਹੇਰਨ",
                                            u"ਬੋਪਾਰਾਏ ਕਲਾਂ",
                                            u"ਰਾਜੋਆਣਾ ਕਲਾਂ",
                                            u"ਇਕੋਲਾਹਾ",
                                            u"ਈਸਰੂ",
                                            u"ਕੋਟ ਪਨਾਇਚ",
                                            u"ਜਾਰਗ",
                                            u"ਬੀਜਾ",
                                            u"ਰਾਜਵਾਲ ਰੋਹਿਨੋ",
                                            u"ਹਥੂਰ",
                                            u"ਕਾਓਕੇ ਕਲਾਂ",
                                            u"ਚਾਕੜ",
                                            u"ਸ਼ੰਕਰ",
                                            u"ਸਿਮਰ",
                                            u"ਕਿਲਾ ਰਾਏਪੁਰ",
                                            u"ਗੁਰਮ",
                                            u"ਘੱਵਦੀ",
                                            u"ਡੇਹਲੋਂ",
                                            u"ਧਰੌਰ",
                                            u"ਰਾਮਗੜ੍ਹ ਸਰਦਾਰਨ",
                                            u"ਰੁੜਕਾ",
                                            u"ਕਟਨਾ ਸਾਹਿਬ",
                                            u"ਜੰਡਾਲੀ",
                                            u"ਰਾਮਪੁਰ",
                                            u"ਸਰਾਭਾ",
                                            u"ਕੈਲਾ",
                                            u"ਘੁੰਗਰਾਨਾ",
                                            u"ਛਪਾਰ",
                                            u"ਸੇਹੋ ਮਾਜਰਾ",
                                            u"ਹਰੀਓਂ ਖੁਰਦ",
                                            u"ਝਾਰ ਸਾਹਿਬ ਉਰਫ ਚੂਹਰਪੁਰ",
                                            u"ਐਂਲੂਲੂ",
                                            u"ਕਮਲਪੁਰਾ",
                                            u"ਸਿਲੋਨੀ",
                                            u"ਬਾਸੀਆਨ",
                                            u"ਲਾਮਾ",
                                            u"ਆਲਮਗੀਰ",
                                            u"ਸੰਗੋਵਾਲ",
                                            u"ਬਡਡੋਵਾਲ",
                                            u"ਫੱਗਲਾ",
                                            u"ਭੈਣੀ ਸਾਹਿਬ",
                                            u"ਰਾਏਨ"
                                        ])
        
        villages[u'ਅਮ੍ਰਿਤਸਰ'] = np.array( [
                                            u"ਊਰਧਨ",
                                            u"ਅਨਾਤਪੁਰਾ",
                                            u"ਅਬੁਸੇਦ",
                                            u"ਸਾਰੰਗਡੇਵ",
                                            u"ਕੋਟ ਰਜ਼ਾਦਾ",
                                            u"ਨਾਨੋਕ",
                                            u"ਪੰਡੋਰੀ",
                                            u"ਰਾਮਦਾਸ ਪੇਂਡੂ",
                                            u"ਅਟਾਰੀ",
                                            u"ਸਰਾਏ ਅਮਾਨਤ ਖ਼ਾਨ",
                                            u"ਸੰਗਨਾ",
                                            u"ਹੁਸ਼ਿਆਰ ਨਗਰ",
                                            u"ਕਸੇਲ",
                                            u"ਚਾਟੀਵਿੰਡ",
                                            u"ਬਸਰਕ ਗਿਲਾਨ",
                                            u"ਭਕਨਾ ਕਲਾਂ",
                                            u"ਅਦਿੱਲੀਵਾਲਾ",
                                            u"ਬੇਸਕਰ",
                                            u"ਗੁਕੇ ਵਾਲੀ",
                                            u"ਬੇਸਕਰ",
                                            u"ਜਗਦੇਵ ਕਲਾਂ",
                                            u"ਕੋਹਲਾ",
                                            u"ਪਦਰੀ",
                                            u"ਲੋਪੋਕੇ",
                                            u"ਬਾਰਾਰ",
                                            u"ਮਨਵਾਲਾ",
                                            u"ਊਧੋ ਨੰਗਲ",
                                            u"ਧਰਮਕੁ ਚੱਕ",
                                            u"ਕਠੂ ਨੰਗਲ",
                                            u"ਸਥਿਆਲਾ",
                                            u"ਜਲਾਲ",
                                            u"ਬਾਬਾ ਬਕਾਲਾ",
                                            u"ਗੁਮਟਾਲਾ",
                                            u"ਮੀਰਨ ਕੋਟ ਕਲਾਂ"
                                        ])

        villages[u'ਗੁਰਦਾਸਪੁਰ'] = np.array([
                                            u"ਸੱਖੋਵਾਲ",
                                            u"ਚੌਧਰੀਵਾਲ",
                                            u"ਭੋਲ",
                                            u"ਹਾਜੀਪੁਰ",
                                            u"ਮਾਧੋਪੁਰ",
                                            u"ਅਲਿਸ਼ਰ",
                                            u"ਦੋਸਪੁਰ",
                                            u"ਲੋਪ"
                                            u"ਕੋਹਾੜ",
                                            u"ਕਾਹਨੂਵਾਲ",
                                            u"ਠਿਕੜੀਵਾਲ",
                                            u"ਪੰਡੋਰੀ ਮਾਇਆ ਸਿੰਘ",
                                            u"ਹਰਪੁਰਾ",
                                            u"ਧੰਡੋਈ",
                                            u"ਭਮ",
                                            u"ਅਲੁਨਾ",
                                            u"ਗਾਂਧੀਵਾਦੀ",
                                            u"ਗੁਰਦਾਸ ਨੰਗਲ",
                                            u"ਛਾਵੜਾ ਊਰਫ ਪੁਰਾਣਾ ਸ਼ਾਲਾ",
                                            u"ਤਾਲਿਬਪੁਰ",
                                            u"ਅਬਦਾਲ",
                                            u"ਘੁਮਮਾਨ",
                                            u"ਟਿਊਜੀਲ",
                                            u"ਡੇਰਾ ਬਾਬਾ ਨਾਨਕ"
                                        ])

        villages[u'ਜਲੰਧਰ'] = np.array( [
                                        u"ਹਰੀਪੁਰ",
                                        u"ਕੱਥਾਰ",
                                        u"ਕੰਡੋਲਾ",
                                        u"ਘਰੀਅਲ",
                                        u"ਖੁਰਦਪੁਰ",
                                        u"ਡਾਰੌਲੀ ਕਲਾਂ",
                                        u"ਡੌਲੀਕ",
                                        u"ਮੰਡੇਰ",
                                        u"ਕੋਟਲਾ ਸੂਰਜਮਲ",
                                        u"ਸੰਦਰਪੁਰ",
                                        u"ਮਾਲਸਿਯਨ",
                                        u"ਹਜ਼ਾਰਾ",
                                        u"ਕੋਟਲੀ ਥਾਨ ਸਿੰਘ",
                                        u"ਜੌਹਲ",
                                        u"ਸੂਰਾ",
                                        u"ਪੱਟਰ ਕਲਾਂ",
                                        u"ਰੰਦਵਾ ਮਾਸੰਡਨ",
                                        u"ਅਲੋਵਲ",
                                        u"ਸ਼ੰਕਰ",
                                        u"ਸਰੀਹ",
                                        u"ਚਕ ਕਲਾਨ",
                                        u"ਬੋਪਾਰਾਏ",
                                        u"ਬਿਲਗਾ",
                                        u"ਮਾਊ ਸਾਹਿਬ",
                                        u"ਸ਼ਾਹਪੁਰ",
                                        u"ਹਰੀਪੁਰ",
                                        u"ਸਾਮਰੀ",
                                        u"ਰਾਜ ਗੋਮਿਲ",
                                        u"ਨਕੋਦਰ"
                                    ])

        villages[u'ਫਿਰੋਜ਼ਪੁਰ'] = np.array([
                                        u"ਹਿੰਮਤਪੁਰਾ",
                                        u"ਸਰਦਾਰਪੁਰਾ",
                                        u"ਜੰਡਵਾਲਾ ਹਾਨਵੰ ਤਾ",
                                        u"ਗਮਾਂਜਲ",
                                        u"ਚੁਘਾ",
                                        u"ਨਨਾਰੀ ਖੋਖਰ",
                                        u"ਲੋਪੋਨ",
                                        u"ਬਿਲਲੀਮਾਰ",
                                        u"ਬਲਬੇ ਕੇ ਹਸਲ",
                                        u"ਮੋਰਾਂਵਾਲਾ",
                                        u"ਸੁਤੰਤਰ ਨਗਰ",
                                        u"ਯੂਗੋਕ",
                                        u"ਸੈਂਡ ਹਾਸ਼ਮ",
                                        u"ਫਿਰੋਜ਼ ਸ਼ਾਹ",
                                        u"ਬਾਜੀਦਪੁਰ",
                                        u"ਮਿਰਜਾਏ"
                                        u"ਢੰਦੀ ਕਾਦੀਮ",
                                        u"ਸੇਖਵਾਂ",
                                        u"ਕੋਟੋਰਾ"
                                    ])

        villages[u'ਪਟਿਆਲਾ'] = np.array([
                                        u"ਅਸਸ਼ਰਪੁਰ",
                                        u"ਕੁਲੇ ਮਾਜਰਾ",
                                        u"ਹਸਨਪੁਰ",
                                        u"ਕਪੂਰੀ",
                                        u"ਹਰਪਾਲਪੁਰ",
                                        u"ਨਨਹੇਰਾ",
                                        u"ਨਾਨੇਰੀ",
                                        u"ਬਪਰਰੋੜ",
                                        u"ਗੁਨੀਕੇ",
                                        u"ਟੌਹੜਾ",
                                        u"ਟੋਡਰਵਾਲ",
                                        u"ਦਕੋਂਡਾ",
                                        u"ਤੂਹੀ",
                                        u"ਡੁਲਡੀ",
                                        u"ਨਰਮਨਾ",
                                        u"ਅਦਾਇਗੀ",
                                        u"ਬਨੇਰਾ ਖੁਰਦ",
                                        u"ਰਾਮਗੜ੍ਹ",
                                        u"ਮਨਸੂਰਪੁਰ ਉਰਫ਼ ਛੀਟਾਂਵਾਲਾ",
                                        u"ਰੋਹਤਾ",
                                        u"ਲੌਟ",
                                        u"ਕਲਿਆਣ",
                                        u"ਰਿਥ ਖੇੜੀ",
                                        u"ਸ਼ੇਰਗੜ",
                                        u"ਦਫਤਰ ਵਾਲਾ",
                                        u"ਬਾਰਾਂ",
                                        u"ਹਰਾਨਾ",
                                        u"ਘਰਮ",
                                        u"ਊਗਣੀ",
                                        u"ਸਰਗੜ",
                                        u"ਮੋਹੀ ਖੁਰਦ"
                                ])
        
        villages[u'ਸੰਗਰੂਰ'] = np.array([
                                        u"ਅੰਦਾਨਾ",
                                        u"ਉਬਵੇਲ",
                                        u"ਖੁਰਾਣਾ",
                                        u"ਖੁਰਾਨੀ",
                                        u"ਬਦਤਰਾਖਾ",
                                        u"ਲੋਹਾ ਖੇਰਾ",
                                        u"ਊਭਾ",
                                        u"ਸ਼ਾਹਪੁਰ ਕਲਾਂ",
                                        u"ਗੰਧੂਆ",
                                        u"ਗੁੱਜਰਾਂ",
                                        u"ਮਹਿਲਨ",
                                        u"ਈਸਾਪੁਰ",
                                        u"ਸ਼ੇਰਪੁਰ",
                                        u"ਹੈਰੀਕੇ",
                                        u"ਮੁਲਵਾਲ",
                                        u"ਕੰਝਲਾ",
                                        u"ਬਰਾੜਵਾਲ",
                                        u"ਅਲੋ ਆਰਖ",
                                        u"ਅਮਰਗੜ",
                                        u"ਚੌੰਦ"
                                        u"ਬੈਗਰੀਅਨ",
                                        u"ਜੰਡਾਲੀ ਕਲਾਂ",
                                        u"ਭੂਸ਼ਨ",
                                        u"ਲਹਿਰਾਗਾਗਾ"
                                    ])
        
        villages[u'ਹੁਸ਼ਿਆਰਪੁਰ'] = np.array([
                                            u"ਹਾਜੀਪੁਰ",
                                            u"ਧੀਮੀਆ",
                                            u"ਅਤਲਗੜ",
                                            u"ਅਧਕਾਰਾ",
                                            u"ਸੰਧਰਨ",
                                            u"ਸਿੰਘੀ ਵਾਲਾ",
                                            u"ਕੋਟਲਾ ਨੌਧ ਸਿੰਘ",
                                            u"ਧੁੱਗਾ",
                                            u"ਬੱਸੀ ਗੁਲਨ ਹੁਸੈਨ",
                                            u"ਬੱਸੀ ਪੁਰਾਣੀ",
                                            u"ਹਰਖੋਵਾਲ",
                                            u"ਚਾਵਵਾਲ",
                                            u"ਬੱਸੀ ਕਲਾਂ",
                                            u"ਬਜ਼ਰੂਰ",
                                            u"ਬਾਜਵਾੜਾ",
                                            u"ਭੁੰਗਾਰਨੀ",
                                            u"ਮੰਡੀਅਲ",
                                            u"ਸਤਨੌਰ",
                                            u"ਕੋਟ ਫਤੂਹੀ",
                                            u"ਜੱਸੋਵਾਲ",
                                            u"ਬਹਿਲਾਲਪੁਰ",
                                            u"ਮੋਰਾਂਵਾਲੀ",
                                            u"ਘੋਰ ਵਹਾ",
                                            u"ਜੌਰਾ",
                                            u"ਮੂਣ ਕਲਾਂ",
                                            u"ਤਲਵਾੜਾ",
                                            u"ਅਲਤਮੁਰ",
                                            u"ਬੋਦਲ",
                                            u"ਕੰਗਮੀ",
                                            u"ਕੁਕਨੇਟ",
                                            u"ਗੋਂਡਪੁਰ",
                                            u"ਭੰਗਲ"
                                    ])
        
        villages[u'ਬਠਿੰਡਾ'] = np.array([
                                    u"ਜੱਸੀ ਬੈੱਗ ਵਾਲੀ",
                                    u"ਜੰਗੀ ਰਾਣਾ",
                                    u"ਬਜਾਕ",
                                    u"ਗੀਨਾ",
                                    u"ਭਾਖੀ ਬੰਦਦਾਰ",
                                    u"ਚੱਕ ਫਤਿਹ ਸਿੰਘ ਵਾਲਾ",
                                    u"ਚੱਕ ਬਖ਼ਤੂ",
                                    u"ਨਾਥਾਨਾ",
                                    u"ਭੁੱਚੋ ਕਲਾਂ",
                                    u"ਘੰਦਾ ਬਾਨਾ",
                                    u"ਫੁਰ ਪੇਂਡੂ",
                                    u"ਭਾਈ ਰੂਪ",
                                    u"ਹਰ ਰਈ ਪੁਰ ਊਰਫ ਭੀਖੀ",
                                    u"ਕੋਟ ਸ਼ਮੀਰ",
                                    u"ਜੰਦਨ ਵਾਲਾ",
                                    u"ਦਾਨ ਸਿੰਘ ਵਾਲਾ",
                                    u"ਮਹਿਮਾ ਸਰਜਾ",
                                    u"ਕਾਂਗਾਰ",
                                    u"ਡਾਯਲਪੁਰਾ ਭਾਈਕਾ",
                                    u"ਰਾਜਗੜ",
                                    u"ਥਮਨ ਗੜ੍ਹ",
                                    u"ਮਿਆਰ ਖਾਨਾ",
                                    u"ਗਿੱਲ ਕਲਾਂ",
                                    u"ਜੀਆਦਾਨ",
                                    u"ਦਿੱਖ",
                                    u"ਪਿਥੋ",
                                    u"ਭਗਤਾ ਭਾਈਿਕਾ",
                                    u"ਭੂਚੋ ਮੰਡੀ"
                                ])

        villages[u'ਤਰਨ ਤਾਰਨ'] = np.array( [
                                        u"ਤਰਨਤਾਰਨ",
                                        u"ਅਪੀਲ",
                                        u"ਖਡੂਰ ਸਾਹਿਬ",
                                        u"ਕੱਲਾ",
                                        u"ਗੋਇੰਦਵਾਲ ਸਾਹਿਬ"
                                        u"ਭਰਮਲ",
                                        u"ਨਾਗੋਕ",
                                        u"ਗਾਂਦੀਵਿੰਡ",
                                        u"ਵੇਰੋਲ",
                                        u"ਭੁੱਚਰ ਕਲਾਂ",
                                        u"ਜੋਹਾਲ ਧਾਇਆਵਾਲਾ",
                                        u"ਦੜੇ ਸਾਹਿਬ",    
                                        u"ਲੋਹਾਰ",
                                        u"ਬ੍ਰਹਮਪੁਰਾ",
                                        u"ਜੀਓਬਾਲਾ",
                                        u"ਝਬਾਲ",
                                        u"ਪੰਜਵੜ",
                                        u"ਰਤੁਲ",
                                        u"ਵੈਨ",
                                        u"ਸਾਖੀਰਾ",
                                        u"ਜੌਰਾ",
                                        u"ਅਕਬਰਪੁਰਾ",
                                        u"ਅਲੀਪੁਰ",
                                        u"ਥਥਾ",
                                        u"ਬਾਤ ਭਹਿਨੀ",
                                        u"ਨਾਥੁ ਚੱਕ"
                                        u"ਸਿੰਘਪੁਰਾ",
                                        u"ਸੁਰ ਸਿੰਘ",
                                        u"ਵਲਟੋਹਾ"
                                    ])

        villages[u'ਮੋਗਾ'] = np.array([
                                        u"ਕੋਟ ਈਸੇ ਖ਼ਾਨ",
                                        u"ਖੋਸਾ ਕੋਟਲਾ",
                                        u"ਘੋਲੋਟੀ",
                                        u"ਜਲਾਲਾਬਾਦ",
                                        u"ਤਖ਼ਤੂਪੁਰਾ",
                                        u"ਦੀਨਾ",
                                        u"ਪੈਟੋ ਹੀਰਾ ਸਿੰਘ",
                                        u"ਸਮਾਧ ਭਾਈ",
                                        u"ਘੋਲੀਆ ਖੁਰਦ",
                                        u"ਨੱਥਵਾਲਾ",
                                        u"ਚੂਹੜ ਚੱਕ",
                                        u"ਧਦੂਈਕੇ",
                                        u"ਦੌਧਰ ਪੂਰਬ",
                                        u"ਮਹਿਰੋਨ",
                                        u"ਮਡੋਕ",
                                        u"ਰਾਮੂਵਲਾ ਨਵਾਂ",
                                        u"ਘੱਲ ਕਲਾਂ",
                                        u"ਦਰੋਲੀ ਭਾਈ",
                                        u"ਬੁਕਾਨ ਵਾਲਾ",
                                        u"ਬਾਰ ਘਰ",
                                        u"ਬੱਧਨੀ ਕਲਾਨ"
                                    ])

        villages[u'ਮੋਹਾਲੀ'] = np.array([
                                        u"ਘਰਾਂ"
                                        u"ਸੋਹਾਨਾ",
                                        u"ਕੁਬਰਾ",
                                        u"ਛੱਟ",
                                        u"ਰਾਣੀ ਮਾਜਰਾ",
                                        u"ਮੁੰਡੋਨ ਸੰਗਤੀਆ",
                                        u"ਢਾਕੋਲੀ",
                                        u"ਕਨਸਲ",
                                        u"ਦੇਸੁ ਮਾਜਰਾ",
                                        u"ਦਾਨ",
                                        u"ਚਪਰਚੀ ਕਲਾਂ",
                                        u"ਚਪਰਚੀ ਖੁਰਦ",
                                        u"ਬਾਰਾਉਲੀ",
                                        u"ਬੀੜ ਛਾਟ",
                                        u"ਲਾਲੜੂ",
                                        u"ਹੁਸ਼ਿਆਰਪੁਰ",
                                        u"ਤੇੁਰ",
                                        u"ਖਿਜ਼ਾਰਾਬਾਦ"
                                    ])

        villages[u'ਮੁਕਤਸਰ'] = np.array( [
                                            u"ਸਾਹਿਬ ਚੰਦ",
                                            u"ਕੋਟ ਭਾਈ",
                                            u"ਛੱਟੇਟਾ",
                                            u"ਥਰੀ",
                                            u"ਮੱਲਾਨ",
                                            u"ਸਰਾਏ ਨਾਗਾ",
                                            u"ਮੰਗਟ ਕੇਰ",
                                            u"ਰੂਪਾਨਾ",
                                            u"ਅਬੁਲ ਖੁਰਾਣਾ",
                                            u"ਸਿੱਖਵਾਲਾ",
                                            u"ਬਾਦਲ",
                                            u"ਲੰਬੀ"
                                    ])

        villages [u'ਕਪੂਰਥਲਾ'] = np.array( [
                                            u"ਸੈਦਪੁਰ",
                                            u"ਤਿੱਬਾ",
                                            u"ਡੱਲਾ",
                                            u"ਭਾਰੋਣਾ",
                                            u"ਮੀਰਾ",
                                            u"ਆਲਮਗੀਰ",
                                            u"ਕਰਹਾਲ ਕਲਾਂ",
                                            u"ਨੂਰਪੁਰ ਡੋਨਾ",
                                            u"ਬੇਤਲ",
                                            u"ਖੁੱਤਰਨ",
                                            u"ਬਾਦਸ਼ਾਹਪੁਰ",
                                            u"ਸ਼ਦੀਪੁਰ",
                                            u"ਨਡਾਲਾ",
                                            u"ਬੁਲੇਵਾਲ",
                                            u"ਹਰਦਾਸਪੁਰ",
                                            u"ਚਚੌਕੀ",
                                            u"ਡੋਮੇਲੀ",
                                            u"ਪਲਾਹੀ",
                                            u"ਭੂਲਾ ਰਾਏ",
                                            u"ਰਾਮਪੁਰ ਸੁਨਰਾ"
                                        ])

        villages[u"ਮਾਨਸਾ"] = np.array([
                                        u"ਭੰਡਾਰ",
                                        u"ਕੋਟ ਧਰਮੂ",
                                        u"ਛਪੀਂਅਨ ਵਾਲੀ",
                                        u"ਛੋਖੋਹਾਰ",
                                        u"ਭਮਾ ਕਲਾਂ",
                                        u"ਟੈਂਡੀਅਨ",
                                        u"ਅਚਨਕ",
                                        u"ਅਕਬਰਪੁਰ ਖੁਡਾਲ",
                                        u"ਕੁਲਾਨਾ",
                                        u"ਬਹਾਦਰਪੁਰ"
                                        u"ਬਾਰਾਹ"
                                        u"ਬਿਰੋ ਕੇ ਕਲਾਂ",
                                        u"ਅਲੀ ਸ਼ੇਰ ਕਲਾਂ",
                                        u"ਅਨਪੜ੍ਹ",
                                        u"ਮਾਘਾਨੀ",
                                        u"ਸੈਮੋਨ",
                                        u"ਖੀਆ ਕਲਾਂ",
                                        u"ਗੁਰਥੀ",
                                        u"ਧਾਲੀਵਾਨ",
                                        u"ਫੈਫਰ ਭਾਈ ਕੇ",
                                        u"ਬਪਪਿਆਨਾ",
                                        u"ਭੋਪਾਲ",
                                        u"ਖਿਆਲਾ ਕਲਾਂ",
                                        u"ਭੈਣੀ ਬਾਗ",
                                        u"ਭੀਖੀ"
                                    ])

        villages[u"ਰੂਪਨਗਰ"] = np.array([
                                        u"ਕਿਰਤਪੁਰ ਸਾਹਿਬ",
                                        u"ਜੀਂਦ ਬਾਰੀ",
                                        u"ਦੀਨੀ",
                                        u"ਦੌਲਵੱਲ",
                                        u"ਭਾਗਵਾਲਾ",
                                        u"ਭੰਬੂ ਸਾਹਿਬ",
                                        u"ਮਕਰੂਨ ਕਲਾਂ",
                                        u"ਸਬੌਰ",
                                        u"ਚਨਾਓਲੀ",
                                        u"ਚਬਰੇਵਾਲ",
                                        u"ਸਾਹੀ",
                                        u"ਕਇਨੌਰ",
                                        u"ਦੁਮੰਨਾ",
                                        u"ਨਾਥਮਲ ਪੁਰ",
                                        u"ਹਰਡੋ ਨਿਮਹੋ",
                                        u"ਕਿਸ਼ਨਪੁਰਾ",
                                        u"ਕੋਟਲਾ ਨਿਹੰਗ",
                                        u"ਘਨੌਲਾ",
                                        u"ਦੁਗਰੀ",
                                        u"ਫਤਿਹਪੁਰ ਬੁੰਗਾ",
                                        u"ਬਿੰਦਰਾਖ",
                                        u"ਚਮਕੌਰ ਸਾਹਿਬ"
                                    ])

        villages[u"ਫ਼ਰੀਦਕੋਟ"] = np.array([
                                            u"ਅਜੀਤ ਗਿੱਲ",
                                            u"ਸੰਧਾਵਾਨ",
                                            u"ਸਰਾਵਾਂ",
                                            u"ਦਲ ਸਿੰਘ ਵਾਲਾ", 
                                            u"ਨੰਗਲ",
                                            u"ਨੱਥਵਾਲਾ"
                                            u"ਪੰਜ ਗਾਰੈਨ ਕਲਾਂ",
                                            u"ਬਹਿਬਲ ਕਲਾਂ",
                                            u"ਮਾਰਕ",
                                            u"ਰਮਨ",
                                            u"ਕੋਟ ਸੁਖਿਆ",
                                            u"ਧੱਦੀ",
                                            u"ਮਾਚਕੀ ਕਲਾਂ",
                                            u"ਮਲਲੇਵਾਲਾ",
                                            u"ਰਾਜੋਵਾਲ"
                                    ])

        villages[u"ਨਵਾਂਸ਼ਹਿਰ"] = np.array([
                                            u"ਊਪਰਾਰ",
                                            u"ਖੁਰਦ",
                                            u"ਜਗਤਪੁਰ",
                                            u"ਜਿੰਗਰਾਨ",
                                            u"ਬਾਜੀਦਪੁਰ",
                                            u"ਮੁਕੰਦਪੁਰ",
                                            u"ਲਿੱਦਰ ਕਲਾਂ",
                                            u"ਚੰਦਪੁਰ ਰੁੜਕੀ",
                                            u"ਦੁਰਗਾਪੁਰ",
                                            u"ਦੌਲਤਪੁਰ",
                                            u"ਸੋਟਰਾਨ",
                                            u"ਖਟਕੜ ਕਲਾਂ",
                                            u"ਚੱਕ ਗੁਰੂ",
                                            u"ਜਿੰਦੋਵਾਲ",
                                            u"ਪਦੀ ਮਟਵਾਲੀ",
                                            u"ਮਾਲੂਪੋਟਾ",
                                            u"ਬੰਗਾ ਬੇਟ",
                                            u"ਰਿਕਾਰ ਬੇਟ",
                                            u"ਬੰਗਾ",
                                            u"ਬਲਚੌਰ",
                                            u"ਰਾਹੋਂ"
                                        ])
        
        villages[u"ਫਤਿਹਗੜ੍ਹ ਸਾਹਿਬ"] = np.array([
                                                u"ਸੌਤੀ",
                                                u"ਕਪੂਰਗੜ੍ਹ",
                                                u"ਭੰਬਲਿਯਨ",
                                                u"ਸੰਗਤਪੁਰ ਸੋਧਿਆਨ",
                                                u"ਤਹਿਲਪੁਰਾ",
                                                u"ਨਲਿਨਾ ਕਲਾਂ",
                                                u"ਸੰਗੋਲ",
                                                u"ਕੋਟਲਾ ਅਜਨਰ",
                                                u"ਕੋਟਲਾ ਬਦਲਾ",
                                                u"ਰਣਵਾਨ",
                                                u"ਗੜ੍ਹੇਰਾ",
                                                u"ਬਦਲੀ ਅਲਾ ਸਿੰਘ",
                                                u"ਭਾਗਨਾ",
                                                u"ਮੁਕਰਮਪੁਰ",
                                                u"ਖੇੜੀ ਬੀਰ ਸਿੰਘ",
                                                u"ਨੰਦਪੁਰ",
                                                u"ਬਹਿਰ",
                                                u"ਅਤਵਾਲਾਲੀ",
                                                u"ਕੂਕਰ ਮਾਜਰਾ"
                                            ])

        villages[u"ਬਰਨਾਲਾ"] = np.array([
                                        u"ਸਹਿਨਾ",
                                        u"ਤਾਲਵਾਲੀ",
                                        u"ਢਿਲਵਾਂ",
                                        u"ਮੌਨਰ",
                                        u"ਸੇਖਾ",
                                        u"ਕਤੂ",
                                        u"ਕਰਮਗੜ੍ਹ",
                                        u"ਕਹਨੇ ਕੇ",
                                        u"ਠਿਕਰੀ ਵਾਲਾ",
                                        u"ਧੌਲਾ",
                                        u"ਪੰਧੇਰ",
                                        u"ਫ਼ਰਾਈਹੀ",
                                        u"ਭੱਠਲਾ",
                                        u"ਭਾਨੀ ਫ਼ੱਤਾ",
                                        u"ਰਾੜਾ ਕਲਾਨ",
                                        u"ਸਹਿਜਰਾ",
                                        u"ਗੰਗੋਹਾਰ", 
                                        u"ਗੇਹਲ",
                                        u"ਬਾਜੀਦ ਕੇ ਕਲਾਂ",
                                        u"ਬਿਲਾ",
                                        u"ਮਹਿਲ ਕਲਾਂ",
                                        u"ਧਨਾਉਲਾ",
                                        u"ਭਦੌੜ",
                                            u"ਟੈਪਾ"
                                        ])

        villages[u"ਪਠਾਨਕੋਟ"] = np.array([
                                            u"ਨਿਹਾਲਪੁਰ",
                                            u"ਮਾਧੋਪੁਰ",
                                            u"ਫਾਲੌਰਾ",
                                            u"ਸਲੌਵਾਲ",
                                            u"ਸੂਖਲਗੜ੍ਹ",
                                            u"ਜਗਤਪੁਰ",
                                            u"ਪਠਾਨ ਚੱਕ",
                                            u"ਬੇਲਾ ਮਾਸਟ ਗੜ੍ਹ",
                                            u"ਬਾਰਾਥ",
                                            u"ਕਰੋਲੀ",
                                            u"ਨਾਗਰਾਤਾ",
                                            u"ਜਹਰੋਲੀ",
                                            u"ਐਨਟੋਰ",
                                            u"ਗਗੈਰਨ",
                                            u"ਤੂਰ",
                                            u"ਨਰੋਲੀ",
                                            u"ਫਾਲੌਰਾ",
                                            u"ਮੱਖਣਪੁਰ",
                                            u"ਸਯੋਤੀ",
                                            u"ਸੰਘੇ",
                                            u"ਚੱਕ ਮਾਧੋ ਸਿੰਘ",
                                            u"ਨੇਪਾਲ",
                                            u"ਭਰੋਲੀ ਕਲਾਂ",
                                            u"ਯਾਨੀਲ",
                                            u"ਸਾਕੋਲ",
                                            u"ਸਮਰਾਲਾ",
                                            u"ਦਾਨਵਾਲ"
                                        ])

        villages[u"ਫਾਜ਼ਿਲਕਾ"] = np.array( [
                                            u"ਸਿਟੋਗਨਨੋ",
                                            u"ਗੱਡਾ ਡੋਬ",
                                            u"ਬੁਰਜ ਊਰਫ ਹਾਨੂਮਾਨਗੜ੍ਹ",
                                            u"ਪੱਟੀ ਸਾਦਿਕ ਊਰਫ ਪੱਟੀ ਉਮਰਾ",
                                            u"ਮਹਿਰਾਜਪੁਰਾ ਊਰਫ ਮਹਿਰਾਣਾ",
                                            u"ਰਾਮਗੜ੍ਹ",
                                            u"ਹਰੀਪੁਰਾ ਊਰਫ ਬਾਰ ਤੀਰਥ",
                                            u"ਕਾਲੀਅਨ ਵਲੀ",
                                            u"ਸ਼ਿਵਨਾ",
                                            u"ਖੂਈ ਖੇੜਾ"
                                            u"ਪੰਜ ਕੋਸੀ",
                                            u"ਥਾਰਾ ਸਿੰਘ ਵਾਲਾ ਹਿਸਾਰ",
                                            u"ਮਹਿਮੂ ਜੋਆ",
                                            u"ਚਕ ਸਾਵਹ ਵਾਲਾ",    
                                            u"ਪਾਇਰੇ ਕੇ ਬੋਦਲਾ",
                                            u"ਬੁਰਧਿਨ ਵਾਲਾ",
                                            u"ਚਕ ਸੋਤਰੀਅਨ",
                                            u"ਖੁਰਾਂਜ",
                                            u"ਸਿੰਘ ਵੇਲਾ",
                                            u"ਪਾਲੀਵਾਲਾ",
                                            u"ਪਰਭਾਟ ਸਿੰਘ ਵਾਲਾ ਉੱਤਰੀ",
                                            u"ਬਹਮਨੀ ਵਾਲਾ",
                                            u"ਮੋਹਰ ਸਿੰਘ ਵਾਲਾ ਹਿਸਾਰ",
                                            u"ਲਾਮੋਚਾਰਰ ਕਲਾਂ ਉੱਤਰ",
                                            u"ਓਝਾਨ ਵਾਲੀ",
                                            u"ਕਾਬੁਲ ਸ਼ਾਹ ਹਿਸਾਰ",
                                            u"ਕੋਰਨ ਵਾਲੀ",
                                            u"ਘੁਰਕਾ",
                                            u"ਜੌਰਾ ਜੰਦ ਊਰਫ ਚਿਮਨੀ ਵਾਲਾ",
                                            u"ਡਿਪੁਲਨਾ",
                                            u"ਵਜਨ ਸ਼ੁਰੂ"
                                            u"ਨਵਾਂ ਹਸਤ"
                                        ])
        return villages
    
##x = Locations()
##x.loadVillages()
##x.loadTowns()
##
##
##class Person:
##    def __init__(self):
##        pass
##    def loadFamousPeople():
##        pass

##for key in x.villages:
##    print(key)
##
##for key in x.towns:
##    print(key)
